In [2]:
import pandas as pd
import numpy as np

from sklearn.preprocessing import LabelEncoder
from sklearn.model_selection import train_test_split

In [3]:
df=pd.read_csv('data.csv')

In [4]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [6]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [7]:
for i in df.columns:
    print(i)

PassengerId
Survived
Pclass
Name
Sex
Age
SibSp
Parch
Ticket
Fare
Cabin
Embarked

In [8]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [9]:
df = df.drop(columns=["PassengerId","Cabin"])

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Name      891 non-null    object
 3   Sex       891 non-null    object
 4   Age       714 non-null    float64
 5   SibSp     891 non-null    int64
 6   Parch     891 non-null    int64
 7   Ticket    891 non-null    object
 8   Fare      891 non-null    float64
 9   Embarked  889 non-null    object
dtypes: float64(2), int64(4), object(4)
memory usage: 69.7+ KB

In [11]:
df["Age"] = df["Age"].fillna(df["Age"].mean())
df["Fare"] = df["Fare"].fillna(df["Fare"].mean())

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Name      891 non-null    object
 3   Sex       891 non-null    object
 4   Age       891 non-null    float64
 5   SibSp     891 non-null    int64
 6   Parch     891 non-null    int64
 7   Ticket    891 non-null    object
 8   Fare      891 non-null    float64
 9   Embarked  889 non-null    object
dtypes: float64(2), int64(4), object(4)
memory usage: 69.7+ KB

In [13]:
df_clean = df.copy()

In [14]:
def encodeCols(cols):
    for i in cols:
        temp = pd.DataFrame({i:df[i].unique()})
        data_LE = LabelEncoder()
        data_LE.fit(np.ravel(temp))
        df_clean[i] = data_LE.transform(df[i])

columns = ['Name', 'Sex', 'Ticket', 'Embarked']
encodeCols(columns)

In [15]:
df_clean.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Name      891 non-null    int64
 3   Sex       891 non-null    int64
 4   Age       891 non-null    float64
 5   SibSp     891 non-null    int64
 6   Parch     891 non-null    int64
 7   Ticket    891 non-null    int64
 8   Fare      891 non-null    float64
 9   Embarked  891 non-null    int64
dtypes: float64(2), int64(8)
memory usage: 69.7 KB

In [16]:
df_clean.head()

   Survived  Pclass  Name  Sex   Age  SibSp  Parch  Ticket     Fare  Embarked
0         0       3   108    1  22.0      1      0     523   7.2500         2
1         1       1   190    0  38.0      1      0     596  71.2833         0
2         1       3   353    0  26.0      0      0     669   7.9250         2
3         1       1   272    0  35.0      1      0      49  53.1000         2
4         0       3    15    1  35.0      0      0     472   8.0500         2

In [17]:
df_clean.to_csv(r'cleaned-data.csv', index=False, header=True)

In [18]:
X = df_clean.iloc()[:, 1:]
y = df_clean.iloc()[:, 0]

In [19]:
trainX, testX, trainY, testY = train_test_split(X, y, test_size=0.2, shuffle=False)

In [20]:
trainX.shape, testX.shape, trainY.shape, testY.shape

((712, 9), (179, 9), (712,), (179,))

In [21]:
trainX.head(5)

   Pclass  Name  Sex   Age  SibSp  Parch  Ticket     Fare  Embarked
0       3   108    1  22.0      1      0     523   7.2500         2
1       1   190    0  38.0      1      0     596  71.2833         0
2       3   353    0  26.0      0      0     669   7.9250         2
3       1   272    0  35.0      1      0      49  53.1000         2
4       3    15    1  35.0      0      0     472   8.0500         2

In [22]:
testX.head(5)

     Pclass  Name  Sex   Age  SibSp  Parch  Ticket      Fare  Embarked
712       1   801    1  48.0      1      0      99   52.0000         2
713       3   459    1  29.0      0      0     506    9.4833         2
714       2   307    1  52.0      0      0     164   13.0000         2
715       3   773    1  19.0      0      0     348    7.6500         2
716       1   241    0  38.0      0      0     610  227.5250         0

In [23]:
trainY.head(5)

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [24]:
from sklearn.svm import SVR
from sklearn.metrics import accuracy_score
import numpy as np

svr = SVR()
svr.fit(trainX, trainY)

pred = np.round(svr.predict(testX)).astype(int)
accuracy = accuracy_score(testY, pred) * 100

print("Survival chances:", pred[:20])
print(f"accuracy: {accuracy:.2f}%")

Survival chances: [0 0 0 0 1 0 0 0 1 0 1 0 1 0 0 0 1 0 1 0]
accuracy: 71.51%